# 여기엔 부사와 부정어만 관리.
# 핵심 단어와 점수는 knu 사전이 담당.

BOOSTER_DICT = {
    "아주": 1.5, "매우": 1.5, "정말": 1.5, "너무": 1.5, "완전": 1.5, "진짜": 1.5,
    "조금": 0.5, "약간": 0.5,
    "별로": -0.5, 
    "전혀": -1.5, 
    "절대": -1.5,
}

NEGATION_LIST = ["안", "못", "않다", "없다", "아니다"]

REPLACE_DICT = {
    '환상적인': '+++', # '환상'과 혼돈
    '환상적이다': '+++',
    '환상적': '+++',
    '재미있다': '++',
    '최고': '++',
    '만족스럽다': '++',
    '치밀어 오른다': '---',
    '화가 난다': '---',
    '화나다': '---',
    '신이난다': '신나다',
    '신이 난다': '신나다',
    '후련하기도': '후련하다',

}

CUSTOM_SCORE_DICT = {
    "+++": 3,
    "++": 2,
    "+": 1,
    "---": -3,
    "--": -2,
    "-": -1,

    "배신자": -2,
    "텅 빈": -1,
    "이": 0, 
    "가": 0,

    # KNU 사전과 KoNLPy의 어간기준이 달라 제대로 분석못함
    "기쁘다": 3, 
    "설레다": 2,
    "슬프다": -2,
    "화나다": -3,
    "힘들다": -1,
    "우울하다": -2,
    "화나다": -3,
    "짜증나다": -2,
    "편안하다": 1,
    "신나다": 2,
    "행복하다": 3,
    "완벽하다": 3,
    "후련하다": 1,
    "아프다": -1,
    "좋다": 2,
    "고달프다": -2,


}